spec/soap_data/delete_folder_request.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2010_SP2"/>
  </soap:Header>
  <soap:Body>
    <DeleteFolder xmlns="http://schemas.microsoft.com/exchange/services/2006/messages" DeleteType="HardDelete">
      <m:FolderIds>
        <t:FolderId Id="test_folder_id"/>
      </m:FolderIds>
    </DeleteFolder>
  </soap:Body>
</soap:Envelope>
